/*
 * Змінні та типи даних
 *
 * - Оголошення змінних з let та const
 * - Перевизначення значення
 * - Найменування змінних
 * - Вибір між const і let
 * - Виведення даних
 * - Отримання даних
 * - Примітивні типи даних: number, string, boolean, null, undefined
 * - Оператор typeof
 */



//* Примітивні типи даних
// - Number: числа (0, -10, 1457, 2.5)
// - String: строки або рядки (все, що записано всередині літералів рядків, тобто, в будь-яких видах лапків(', ", `)) - "Hello world", "100"
// - Boolean(bool): логічний тип, який вміє зберігати всього два значення: правда і неправда, тобто true або false
// undefined — відсутність визначення (змінна є, але значення їй не призначено)
// null — явно призначена відсутність (змінна існує, і ми спеціально сказали, що значення "немає")



// typeof - повертає тип даних певного значення або змінної

