/*
 * - Подія input - викликається кожного разу як відбулась зміна в полі вводу (chatty event)
 * - Подія blur - викликається кожного разу як з інпуту пропадає фокус
 * - Подія change - викликається кожного разу як з інпуту пропадає фокус АЛЕ якщо в інпуті щось змінилось
 */

const inputEl = document.querySelector(".js-user-name");
const checkboxPolicyEl = document.querySelector(".js-policy-checkbox");

/*
? Виводь в консоль все що користувач вводить в input

*/

/*
? Користувач вводить в input своє ім'я після втрати
? фокусу отримує alert з повідомленням-привітанням
 */

/*
? Після того, як користувач активує чекбокс, виводиться alert
*/
