/*
 * Ітерація по масиву
 *
 * - Ітерація по масиву циклом for
 * - Цикл for...of
 * - Різниця у використанні for и for...of
 */

const friends = ["Mango", "Kiwi", "Poly", "Ajax"];

console.log(friends);

//? Через цикл for

console.log("======");
//? Через цикл for...of - перебирає значення масиву напряму

/*
? Напиши скрипт для перебора масиву fruits.
? Для кожного елемента масиву виведи в консоль рядок
? у форматі номер_елемента: значення_елемента.
? Нумерація елементів повинна починатися з 1.
*/

const fruits = ["banana", "apple", "mango", "lemon"];
